// Задача 1
// -----------------------
// Дан массив чисел. Найди:
// 1) сумму всех чисел
// 2) максимальное число
// 3) количество чисел больше 10

const numbers = [5, 12, 3, 20, 11, 7];



// Задача 2
// -----------------------
// Дан объект с товарами и ценами.
// 1) Найти товар с самой высокой ценой.
// 2) Посчитать общую стоимость всех товаров.
// 3) Вывести товары, цена которых меньше 300.

const products = {
    mouse: 150,
    keyboard: 350,
    monitor: 1200,
    usb: 50,
    speaker: 270
};


// Задача 3
// -----------------------
// Дан массив строк имён. Нужно:
// 1) вывести только те имена, где больше 5 букв
// 2) создать новый массив имён в верхнем регистре
// 3) посчитать, сколько имён начинается на букву "a"

const names = ["alex", "marina", "andrew", "kate", "alina", "max"];



// Задача 4
// -----------------------
// Удалить повторяющиеся слова из строки, сохранив порядок.
// Сохранить результат в новую строку.

const str2 = "apple banana apple orange banana kiwi apple";


// Задача 5
// -----------------------
// Разделить товары на 3 категории по цене и разместить названия в соответствующие массивы:
// <2, 2-5, >5
// 
const products4 = {
  bread: 1.2,
  milk: 0.9,
  cheese: 4.5,
  meat: 6.2,
  salad: 2.3,
  cola: 1.5
};


