// a. Преобразовать всю строку в верхний регистр.
// b. Заменить "Alex" на ваше имя.
// c. Подсчитать, сколько символов в новой строке.
// d. Проверить, содержит ли в строке слово "name".
let greeting = "Hello, my name is Alex.";



// a. Создать строку, которая говорит:
//    The product "Basketball" costs $24.90.
//    (но используя переменные, а не вручную записывая предложение!)
// b. Преобразовать всю строку в верхний регистр.
let product = "Basketball";
let price = 24.9;


// Напишите код, который:
// убирает пробелы по краям, а затем выводит окончательную длину обрезанной строки.
let message = "   JavaScript is fun!   ";


// a. Объедините две строки firstName и lastName через пробел.
// b. Преобразуйте результат в «Title Case» (каждое слово с заглавной буквы).
let firstName = "john";
let lastName = "doe";


// a. Найдите позицию первого вхождения буквы "a".
// b. Найдите позицию последнего вхождения буквы "a".
// c. Вырежьте подстроку от индекса 2 до индекса 7 (не включая 7).
let text = "JavaScript is amazing!";


// a. Проверьте, начинается ли строка с "http://" или "https://" (startsWith).
// b. Проверьте, заканчивается ли строка на ".com" или ".org" (endsWith).
let url = "https://example.com";


// a. Замените все пробелы на подчёркивания.
// b. Ограничьте замену первыми тремя вхождениями.
let phrase = "one two three four five";


