// Создай переменную text со строкой.
// Если длина строки больше 10 символов — выведи "Длинная строка",
// иначе — выведи "Короткая строка".

let text = "Привет, мир!";
// Твой код ниже





// Создай две переменные a и b.
// Если a больше b, выведи "Первое число больше",
// если b больше a, выведи "Второе число больше",
// иначе — выведи "Числа равны".

let a = 5;
let b = 10;
// Твой код ниже





// Создай объект user с полями name и age.
// Если возраст 18 или больше — выведи "Пользователь [name] совершеннолетний",
// иначе — "Пользователь [name] несовершеннолетний".

let user = {
  name: "Оля",
  age: 17
};
// Твой код ниже



// Создай переменную login со строкой.
// Если в строке есть пробел (" "), выведи "Логин не должен содержать пробел",
// иначе — "Логин подходит".

let login = "my login";
// Твой код ниже



// Создай объект car с полями brand и year.
// Если год выпуска больше или равен 2015 — выведи "Современная машина"
// иначе — "Старая модель".

let car = {
  brand: "Lada",
  year: 2009
};
// Твой код ниже