// Для каждой заданной строки с датой
// 1. Создай с помощью moment объект даты.
// 2. Выведи в консоль в указаном формате.
// Дату и конечную строку сохрани в отдельные переменные.


const dateString1 = "2025-02-10";  // вывод: "10 Feb 2025"
const dateString2 = "23/11/2025 14:30";  // вывод: "23 November 2025 2:30 PM"
const dateString3 = "Sunday, 23 November 2025"  // вывод: "23/11/25"
const dateString4 = "16.02.05 18:32"  // вывод: "2005-02-16 18:32"
const dateString5 = "December 5th, 2023 08:15 AM"  // вывод: "2023-12-05 08:15"